
## Plan Result (stg)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "api-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":655,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->